app/controllers/api/greetings_controller.rb

  def index
    @greetings = Greeting.find(rand(1..5))
---
SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]